IDEA Open Model
InclinedReinfBarType Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Type of inclined bar
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum InclinedReinfBarType
Public Enumeration InclinedReinfBarType
Members
Member name | Value | Description
InputByLength | 0 |  Length of bar is directly in put by user
FullLength | 1 |  Length is extended to outer edges of structure
See Also
Reference
IdeaRS.OpenModel.Detail Namespace